{
    "data": {
        "productId": "VA",
        "effectiveFrom": "2020-09-30T00:38:00.000Z",
        "lastUpdated": "2023-03-15T01:22:32.389Z",
        "productCategory": "TRANS_AND_SAVINGS_ACCOUNTS",
        "name": "Virtual Accounts",
        "description": "HSBC offers two types of Virtual Accounts (VA): (1) Traditional VA - A unique reference number in the format of a BSB and account number that payors can use to make a payment to help Wholesale banking customers with payor identification; (2) Next Generation Virtual Account Management - A solution that can help reduce the number of physical bank accounts held by the customer and streamline bank account management and reconciliation activities",
        "brand": "VA",
        "brandName": "Wholesale Banking",
        "applicationUri": "https://www.business.hsbc.com.au/en-au/products-and-solutions/bank",
        "isTailored": true,
        "features": [
            {
                "featureType": "UNLIMITED_TXNS",
                "additionalValue": "There is no limit to the number of transactions that can be made into the virtual account"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Applicable to Next Generation Virtual Account Management only. User interface is accessible through HSBCnet. Enables customer to visualise virtual account balances, self-manage certain virtual account parameters (open/close, rename virtual accounts), download virtual account reporting."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Receivables reporting",
                "additionalInfo": "Virtual account transactions are identifiable in the regular bank statement. However, a dedicated report for receipts, including receipts into a virtual account, is available as an optional feature."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "BUSINESS",
                "additionalValue": "Corporate customers only"
            }
        ],
        "fees": [
            {
                "name": "Establishment Fee - Traditional VA",
                "feeType": "UPFRONT",
                "amount": "1500.00",
                "currency": "AUD"
            },
            {
                "name": "Maintenance fee",
                "feeType": "PERIODIC",
                "amount": "250.00",
                "currency": "AUD",
                "additionalValue": "Monthly fee per physical account",
                "additionalInfo": "Applicable to Traditional VA and Next Generation Virtual Account Management"
            },
            {
                "name": "Transaction fee - Traditional VA",
                "feeType": "TRANSACTION",
                "amount": "0.30",
                "currency": "AUD",
                "additionalValue": "Fee charged for each transaction made into a virtual account. This is  charged in addition to the usual transaction fees."
            },
            {
                "name": "Establishment Fee - Next Generation Virtual Account Management",
                "feeType": "UPFRONT",
                "amount": "800.00",
                "currency": "AUD"
            },
            {
                "name": "Maintenance fee - Next Generation Virtual Account Management",
                "feeType": "PERIODIC",
                "amount": "300.00",
                "currency": "AUD",
                "additionalValue": "Monthly fee per virtual account. This is charged in addition to the maintenance fee for the physical account.",
                "additionalInfo": "$1 per virtual account, subject to a minimum charge of $300."
            }
        ]
    },
    "links": {
        "self": "https://public.ob.business.hsbc.com.au/cds-au/v1/banking/products/VA"
    },
    "meta": {}
}