{
    "data": {
        "productId": "5400-3309",
        "effectiveFrom": "2019-12-31T14:00:00.00000Z",
        "effectiveTo": "2030-12-31T13:59:59.00000Z",
        "lastUpdated": "2023-11-22T14:01:00.00000Z",
        "productCategory": "BUSINESS_LOANS",
        "name": "Commercial 3 Year Fixed - Residentially Secured IO",
        "description": "Apply to pay interest only for terms between 1,2,3 or 5 years whilst at the same time fixing the interest rate for the same period.",
        "brand": "Great Southern Bank",
        "brandName": "Great Southern Bank",
        "applicationUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans#how",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans",
            "termsUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans",
            "eligibilityUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans",
            "feesAndPricingUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans#rates"
        },
        "bundles": [
            {}
        ],
        "eligibility": [
            {
                "eligibilityType": "BUSINESS",
                "additionalInfo": "Loan purpose must be business related."
            },
            {
                "eligibilityType": "BUSINESS",
                "additionalInfo": "Applicant/s Guarantors must be a legal entity registered within Australia."
            },
            {
                "eligibilityType": "MIN_AGE",
                "additionalValue": "18",
                "additionalInfo": "All individuals, directors, guarantors, trustees, members must be 18+ yrs."
            },
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "All individuals, directors, guarantors, trustees, members must be an Australian Resident."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Applications for Business Loans are subject to credit approval. Property offered as security must be acceptable within policy."
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "20000.00"
            },
            {
                "constraintType": "MAX_LIMIT",
                "additionalValue": "1000000.00"
            }
        ],
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "$0 Monthly or annual fees."
            },
            {
                "featureType": "REDRAW",
                "additionalInfo": "Need your extra repayments? No worries! All of our business loans come with free redraw. A $200 minimum withdrawal amount applies for redraws conducted in-branch."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Flexible loan options. During the overall term you can choose a variable rate or fix the interest rate for 1, 2, 3 or 5 years as many times as you like. Or apply for an interest only period of up to 5 years at any time. Your loan account number always stays the same. An early payout cost may apply if a fixed loan is terminated during the fixed rate period."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Split Loan alternative. You can request us to split your new business loan - a portion on a fixed rate and the remainder at a variable rate or two different fixed rates."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Longer loan terms = lower repayments. Eligible customers can request an overall term of up to 30 years for loans secured by qualifying residential property or up to 25 years with suitable commercial property security. The term of the loan will be subject to relevant credit criteria, eligibility, terms and conditions, and will vary according to the loan amount, type and location of the security provided."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Choose your security. Secure your loan with residential or commercial property. Or combine with a home loan and use your home equity."
            },
            {
                "featureType": "RELATIONSHIP_MANAGEMENT",
                "additionalInfo": "All business loans come with a dedicated Relationship Manager."
            },
            {
                "featureType": "EXTRA_REPAYMENTS",
                "additionalInfo": "Enjoy the flexibility of being able to make unlimited extra repayments without penalty."
            }
        ],
        "fees": [
            {
                "name": "Account Information Fee",
                "feeType": "EVENT",
                "amount": "20.00",
                "currency": "AUD",
                "additionalInfo": "Account informaton fee is payable when customer request the following:\n- An annual audit certificate on a Great Southern Bank account\n- A copy of a cheque or Visa voucher\n- Personal information, traces, document copies (other than those specified above) and/or information pertaining to an account\nWhere further investigation is required an additional hourly rate of $20 per hour will apply. An estimate of the costs involved will be provided prior to the work being undertaken."
            },
            {
                "name": "Arrears Letter Fee",
                "feeType": "EVENT",
                "amount": "22.00",
                "currency": "AUD",
                "additionalInfo": "Payable where Great Southern Bank sends you a letter in relation to arrears on your account."
            },
            {
                "name": "Default Notice Fee",
                "feeType": "EVENT",
                "amount": "33.00",
                "currency": "AUD",
                "additionalInfo": "Default notice fee is payable where Great Southern Bank sends you a default notice in relation to outstanding arrears on your account."
            },
            {
                "name": "Early Payout Cost (EPC)",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "When you enter into a fixed rate loan contract, you are effectively locking in the loan interest rate offered to you for an agreed period of time (e.g. 5 years). If you decide to switch or payout your fixed rate loan before the end of your agreed period, you are effectively breaking that fixed rate loan agreement, an EPC that could cost you thousands of dollars may apply. Please refer to our ‘Early Payout Cost Factsheet’ for more information. Contracts entered into prior to 28 September 2021, the amount is referred to as an Early Payout Fee."
            },
            {
                "name": "Property Valuation Fee",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "A property valuation fee is payable for each commercial property offered as security. The fee is payable at loan settlement and will be included in your Credit Contract. The amount of the fee will be subject to the Great Southern Bank panel valuers scale of fees current at that time. A property valuation fee may also be charged if Great Southern Bank considers it necessary to revalue the property at any time."
            },
            {
                "name": "Monthly Account Keeping Fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "currency": "AUD",
                "additionalValue": "P1M"
            },
            {
                "name": "Debt Collection Fee",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "Costs incurred in the recovery of outstanding debts vary depending on the nature of the default.  These costs are applied by the Solicitors or independent contractors engaged to undertake action to recover the funds and are debited to the account that is \"out of order\"."
            },
            {
                "name": "Security Adminstration Fee",
                "feeType": "UPFRONT",
                "amount": "235.00",
                "currency": "AUD",
                "additionalInfo": "For each security offered to the Great Southern Bank loan. A securities administration fee applies to all secured credit facilities. The securities administration fee represents the average cost based on typical charges incurred in settling loans, including: \n• Progressive drawdowns \n• Bank cheque fee \n• Agent fee \n• Land title search \n• Credit reference fee \n• PPSR searches \n• PPSR charges"
            },
            {
                "name": "Discharge Fee",
                "feeType": "EXIT",
                "amount": "500.00",
                "currency": "AUD",
                "additionalInfo": "If you pay out the loan partially or in full where a discharge of security is required, or you request a discharge of a security, a discharge fee is payable (per release or transaction)."
            },
            {
                "name": "Redraw Fee",
                "feeType": "WITHDRAWAL",
                "amount": "0.00",
                "currency": "AUD",
                "additionalInfo": "$200 minimum withdrawal applies in branch."
            },
            {
                "name": "Establishment Fee",
                "feeType": "UPFRONT",
                "amount": "750.00",
                "currency": "AUD",
                "additionalInfo": "Establishment Fee irrespective of total loan amount applied for. In some instances, where business loan applications are complex, an application fee may be required before a loan is considered. In these instances, we will advise the borrower of the applicable fee prior to commencement of the application."
            },
            {
                "name": "Production Fee",
                "feeType": "EVENT",
                "amount": "100.00",
                "currency": "AUD",
                "additionalInfo": "If you request a title held by Great Southern Bank to be produced to a relevant state’s land titles office for any purpose, a production fee is payable."
            },
            {
                "name": "Re-documentation Fee",
                "feeType": "EVENT",
                "amount": "300.00",
                "currency": "AUD",
                "additionalInfo": "Where a borrower requests, and Great Southern Bank agrees, to a restructure of a loan between approval and funding and that change requires amended documentation to be prepared, a fee will be payable."
            },
            {
                "name": "Variation Fee",
                "feeType": "EVENT",
                "amount": "300.00",
                "currency": "AUD",
                "additionalInfo": "A variation fee is payable if you request any changes to the Credit Contract or Security - for example:\n- Re-arrange and/or substitute a security on a mortgage\n- Consent to any dealings in relation to property\n- Switch from one interest rate product to another, at the request of the borrower\n- Where a fixed interest rate has decreased between loan approval and loan funding, at the request of the borrower."
            },
            {
                "name": "Increase to an existing Business Term Loan or Overdraft",
                "feeType": "EVENT",
                "balanceRate": "0.0015",
                "currency": "AUD",
                "additionalInfo": "As a guide, an establishment fee of 0.15% of the total additional loan amount / limit applied for will apply, subject to a minimum fee of $400."
            },
            {
                "name": "Government fees and charges",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "Government fees and charges relating to stamp duty and registration are payable on an event causing a change or variation to the transaction and/or security being taken in the applicable state or territory. The amount of the fee will be subject to the relevant government scale of fees current at that time."
            },
            {
                "name": "Solicitors costs",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "Solicitors costs are payable where they are engaged to prepare documents or provide advice relating to your matter on Great Southern Bank’s behalf."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "FIXED",
                "rate": "0.0654",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS",
                "repaymentType": "INTEREST_ONLY",
                "additionalValue": "P36M",
                "additionalInfoUri": "https://www.greatsouthernbank.com.au/business-finance/business-banking-loans#rates"
            }
        ]
    },
    "links": {
        "self": "https://api.open-banking.greatsouthernbank.com.au/cds-au/v1/banking/products/5400-3309"
    }
}