{
    "data": {
        "productId": "SecuredBusinessLoan",
        "lastUpdated": "2022-03-21T09:16:04Z",
        "productCategory": "BUSINESS_LOANS",
        "name": "Secured Business Loan",
        "description": "Make your business plans happen with a Westpac business loan.",
        "brand": "Westpac",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.westpac.com.au/business-banking/business-loans/small-business-loans/business-lending/",
            "termsUri": "https://www.westpac.com.au/business-banking/business-loans/small-business-loans/business-lending/",
            "eligibilityUri": "https://www.westpac.com.au/business-banking/business-loans/small-business-loans/business-lending/",
            "feesAndPricingUri": "https://www.westpac.com.au/business-banking/business-loans/small-business-loans/business-lending/"
        },
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "Make extra payments, which could reduce interest paid over the life of the loan.Option to swap between interest only or principal and interest repayments.Redraw allows you to make extra payments and access these funds later."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Provides certainty in knowing what you're up for with each repayment. Protects you from potential future interest rate movements. "
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Keep track of your Business Loan balance and financials online (and at tax time, export details of interest paid to your accounting software)."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "The term of your Business Loan will vary depending on security offered (you may swap if your situation changes):Loan term up to 30 years when residential property used as security. Loan term up to 25 years when commercial or rural property used as security. Loan term up to 5 years when unsecured (guarantee may be required)."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Variable rate available from 2.99% p.a. to 3.99% p.a. and Fixed rate available from 2.38% p.a.5 to 3.99% p.a. depending on security offered. Please contact us for  more details"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Borrow up to $3m to buy owner-occupied commercial business premises or for business expansion with loan to value ratios of up to 100% of the value of residential property security or 80% of the value of non-specialised commercial property security"
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "20000.00"
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Customer is - A business entity domiciled in Australia; or an individual18 years and above or strata corporation dominiled in Australia and requires the funding for business or investment purposes other than investment in residential property."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Banking and borrowing history - existing bank accounts and lending products must be within their approved limits"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Credit history - all borrowers, owners, directors and guarantors must have clear credit records. All statutory payments and ATO liabilities need to be up to date and not under arrangement"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Security - depending on your circumstances, business loans can be unsecured or require security in the form of residential, commercial or rural property.  A guarantee will also be required by company directors for corporate borrowers"
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.0541",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalInfo": "Base Rate, a Margin may apply"
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/SecuredBusinessLoan"
    },
    "meta": {}
}