{
    "data": {
        "features": [
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Maturity reminders",
                "additionalInfo": "We will send you a confirmation letter when you open and renew your term deposit. For term deposits with a term of six months or more, we will give you an account statement every six months. We will also send you a term deposit reinvestment notice before it matures, not only as a reminder but to also explain what you can do next."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Branch Access",
                "additionalInfo": "Over the counter transactions available at Bankwest branches."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Deposit Conditions",
                "additionalInfo": "The deposit must not be used as security for any amount owed to us or any other person. Additionally, the deposit must not be used, as a mortgage offset account or otherwise, to reduce your liability to pay interest on other debts owed to us."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Early Repayment Adjustment",
                "additionalInfo": "Changes aimed at strengthening the banking system mean we need 31 days' notice if you want to withdraw your funds before the maturity date. You can still access your money at maturity and during the grace period. You may request the withdrawal of all or part of your funds prior to the maturity date provided that you give 31 days' notice. If your Term Deposit has less than 31 days to maturity, you will only be able to access funds on the maturity date. The notice period starts on the day you request withdrawal. If you are experiencing hardship and need your funds before maturity, please contact us. If you withdraw all or part of your funds prior to the maturity date, your entitlement to interest in respect of the deposit will be reduced, according to when an early repayment is made and your entitlement to tax benefits will be impacted. Please refer to the Term Deposits Terms & Conditions for further details. However, 31 days notice is not required to transfer funds to a different farm management deposit account. You will be required to provide written request and cover the cost to transfer the total or part of the credit balance to the other financial institution."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Interest Redirection",
                "additionalInfo": "You must nominate a Bankwest branded account or an account at another financial institution to have the credit interest paid in to."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Maturity Notification Period",
                "additionalInfo": "At the end of your term, unless we notify you that we will not be renewing your deposit, you have seven calendar days (known as your 'grace period') to let us know you want to withdraw your funds or reinvest them. If you don't let us know, your funds will be automatically reinvested for the same term at the applicable rate."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "The Commonwealth's Farm Management Deposit Scheme allows primary producers, under the Pay As You Go system, to reduce their instalment income for an instalment period by the amount of the Farm Management Term Deposit (FMTD) made during that period. The scheme provides tax benefits if deposits in the FMTD are kept for a minimum of 12 months. The reduction is limited to the amount that you can reasonably expect to deduct for the deposit for the income year in which the deposit is made. However, the instalment income for the period cannot be reduced below nil."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "When you withdraw funds from the Farm Management Term Deposit within 12 months of the initial deposit, you may not qualify for the full tax benefits associated as the funds may cease to qualify as a farm management deposit. You may have to seek an amended tax assessment for the relevant period in which a deduction was claimed. If neither your tax file number, nor Australian Business Number, has been given to the Bank, the amount withdrawn will also be subject to withholding tax at a rate equal to the sum of the top marginal tax rate and the Medicare levy."
            }
        ],
        "constraints": [
            {
                "constraintType": "MAX_BALANCE",
                "additionalValue": "800000.00",
                "additionalInfo": "The total amount deposited across all FMD accounts held by the customer at all financial institutions must not exceed $800,000."
            },
            {
                "constraintType": "MIN_BALANCE",
                "additionalValue": "1000.00",
                "additionalInfo": "The account must have a minimum balance of $1,000 throughout the term unless you close the account prior to maturity or a transfer is effected. If a minimum balance of $1,000 is not maintained by you throughout the term, your tax entitlements may be adversely affected."
            },
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "1000.00",
                "additionalInfo": "The amount of any repayment of the deposit must be at least $1,000 except where the entire amount of the deposit is repaid."
            },
            {
                "constraintType": "OPENING_BALANCE",
                "additionalValue": "1000.00",
                "additionalInfo": "Minimum and maximum deposit amounts apply. The initial deposit into the account must be at least $1,000 and not more than $800,000 at any time in any year of income. If you have consented to renew the account on maturity, the minimum initial deposit requirement does not apply to the renewed account. Once the initial deposit is made, no additional deposits can be made to the account. Where further funds are to be deposited a new account must be opened."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "AU",
                "additionalInfo": "Available to Australian citizens and permanent or temporary residents with an Australian residential address."
            },
            {
                "eligibilityType": "NATURAL_PERSON",
                "additionalInfo": "The Account is only available to an individual including an individual trustee acting for a beneficiary who is under a legal disability. The Account is not available to individuals jointly, partnerships or corporations."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "The deposit must be made by only one person and on behalf of only one person. Your rights as a depositor are not, and must not be, transferable to another person."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "The Commonwealth's Farm Management Deposit Scheme under the Income Tax Assessment Act 1997 (Cth) is designed to allow primary producers with a taxable non-primary production income of not over $100,000 (from 1 July 2014), to shift before-tax income from years when they need it least to years when it is most needed, in order to assist them manage their exposure to adverse economic events and seasonal fluctuations. Specific requirements applying to this account are set out in the Income Tax Assessment Act 1997. A breach of the requirements may result in the deposit not being treated as a farm management deposit and the loss of tax benefits. Prior to making a deposit, we recommend you obtain advice from an independent tax adviser."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Interest or other earnings on the deposit must first be paid to you before being invested as a farm management deposit with us."
            },
            {
                "eligibilityType": "OTHER",
                "additionalValue": "Primary Producer",
                "additionalInfo": "You, as the owner of the deposit, must be a primary producer when the deposit is made, with a taxable non-primary production income of up to $100,000. As Farm Managed Term Deposits have tax implications, it's important to ensure that a tax file number is provided when opening the account."
            }
        ],
        "fees": [
            {
                "name": "Maintenance Fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "currency": "AUD",
                "additionalValue": "P1M"
            }
        ],
        "depositRates": [
            {
                "depositRateType": "FIXED",
                "rate": "0.0015",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "tiers": [
                    {
                        "name": "Amount",
                        "unitOfMeasure": "DOLLAR",
                        "minimumValue": 1000.0,
                        "maximumValue": 800001.0,
                        "rateApplicationMethod": "WHOLE_BALANCE"
                    },
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 1,
                        "maximumValue": 1
                    }
                ],
                "additionalValue": "P1M",
                "additionalInfo": "Fixed Credit Interest."
            },
            {
                "depositRateType": "FIXED",
                "rate": "0.0035",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P3M",
                "tiers": [
                    {
                        "name": "Amount",
                        "unitOfMeasure": "DOLLAR",
                        "minimumValue": 1000.0,
                        "maximumValue": 800001.0,
                        "rateApplicationMethod": "WHOLE_BALANCE"
                    },
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 3,
                        "maximumValue": 3
                    }
                ],
                "additionalValue": "P3M",
                "additionalInfo": "Fixed Credit Interest."
            },
            {
                "depositRateType": "FIXED",
                "rate": "0.005",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P9M",
                "tiers": [
                    {
                        "name": "Amount",
                        "unitOfMeasure": "DOLLAR",
                        "minimumValue": 1000.0,
                        "maximumValue": 800001.0,
                        "rateApplicationMethod": "WHOLE_BALANCE"
                    },
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 9,
                        "maximumValue": 9
                    }
                ],
                "additionalValue": "P9M",
                "additionalInfo": "Fixed Credit Interest."
            },
            {
                "depositRateType": "FIXED",
                "rate": "0.0055",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P6M",
                "tiers": [
                    {
                        "name": "Amount",
                        "unitOfMeasure": "DOLLAR",
                        "minimumValue": 1000.0,
                        "maximumValue": 800001.0,
                        "rateApplicationMethod": "WHOLE_BALANCE"
                    },
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 6,
                        "maximumValue": 6
                    }
                ],
                "additionalValue": "P6M",
                "additionalInfo": "Fixed Credit Interest."
            },
            {
                "depositRateType": "FIXED",
                "rate": "0.01",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P12M",
                "tiers": [
                    {
                        "name": "Amount",
                        "unitOfMeasure": "DOLLAR",
                        "minimumValue": 1000.0,
                        "maximumValue": 800001.0,
                        "rateApplicationMethod": "WHOLE_BALANCE"
                    },
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 12,
                        "maximumValue": 12
                    }
                ],
                "additionalValue": "P12M",
                "additionalInfo": "Fixed Credit Interest."
            }
        ],
        "productId": "ca8e0f398ab242a3b9b52bb1f5663a78",
        "effectiveFrom": "1998-12-06T13:00:00Z",
        "effectiveTo": "9999-12-30T13:00:00Z",
        "lastUpdated": "2022-06-01T00:06:27.977664Z",
        "productCategory": "TERM_DEPOSITS",
        "name": "Farm Management Term Deposit",
        "description": "For primary producers who want to receive a fixed interest rate for set terms from 1 month to 12 months and want to participate in the Commonwealth's Farm Management Deposit Scheme.",
        "brand": "Bankwest",
        "brandName": "Bankwest",
        "applicationUri": "https://www.bankwest.com.au/business/accounts",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.bankwest.com.au/business/accounts",
            "termsUri": "https://www.bankwest.com.au/business/accounts",
            "eligibilityUri": "https://www.bankwest.com.au/business/accounts",
            "feesAndPricingUri": "https://www.bankwest.com.au/business/accounts"
        }
    },
    "links": {
        "self": "https://open-api.bankwest.com.au/bwpublic/cds-au/v1/banking/products/ca8e0f398ab242a3b9b52bb1f5663a78"
    }
}