{
    "data": {
        "features": [
            {
                "featureType": "BILL_PAYMENT",
                "additionalValue": "Direct Debit",
                "additionalInfo": "You can set up direct debits."
            },
            {
                "featureType": "CARD_ACCESS",
                "additionalValue": "Bankwest Debit Card",
                "additionalInfo": "Access your money with a Bankwest Debit Card."
            },
            {
                "featureType": "CARD_ACCESS",
                "additionalValue": "Business Debit Mastercard",
                "additionalInfo": "Have easy access to your money with a Business Debit Mastercard. It's available to Australian citizens and temporary or permanent residents over 16 with an Australian residential address (limited exceptions may apply subject to conditions)."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Bankwest Online Banking",
                "additionalInfo": "You can access this account in Bankwest Online Banking (BOB) and the Bankwest App."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Online Business Banking",
                "additionalInfo": "Enjoy secure Online Business Banking at your fingertips. As a customer on this account you may also be entitled to apply for our Online Business Banking service. If you apply for that service you will be provided with a separate Product Disclosure Statement and your use of the service will be a matter of separate agreement with us. Separate fees are applicable for this service."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Phone Banking",
                "additionalInfo": "You can bank over the phone."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Cheque Books",
                "additionalInfo": "Cheque access is available."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Other Services",
                "additionalInfo": "Other fees which the Bank charges for its services, including services not specific to this account but for which you may be charged are listed in our Bankwest Your Guide to Banking Fees brochure."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Periodical Payments",
                "additionalInfo": "You can set up ongoing payments for things like bills or loan repayments."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Sweep Facility",
                "additionalInfo": "The Sweep Facility operates as an automatic periodic transfer of funds only between nominated Bankwest accounts held with us in the same name(s) and capacity(ies). It is governed by the terms of the Sweep Facility authority you give to us."
            },
            {
                "featureType": "OVERDRAFT",
                "additionalValue": "Overdraft",
                "additionalInfo": "Offers an overdraft facility (minimum $100,000), subject to lending approval and criteria. Fees will apply."
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "250000.00",
                "additionalInfo": "This account is only available as part of an overall lending package. The Overdraft Facility available with this account and the terms and conditions on which it is provided to you will be the subject of a separate agreement with us. However, the package must comprise a minimum $100,000 overdraft facility and can include a mixture of Bankwest Business Loans (variable or fixed interest rate facilities) and Bankwest Business Asset Finance facilities (subject to the Bank's lending criteria being satisfied). Should, at any time, your total facilities fall below the $250,000 minimum or should the nature of those facilities not meet the requirements of AgriOne Package, the Bank may convert your AgriOne Account into a Business Zero Transaction Account."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "AU",
                "additionalInfo": "The business was established and has tax residency in Australia."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Applications for Business Loans are subject to the Bank's normal credit approval."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Only available to relationship managed customers.",
                "additionalInfoUri": "https://www.bankwest.com.au/business"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "The customer must either be a natural person (with no ABN or ACN), or a business type that is either a sole trader, partnership, company, trust, super fund (including self-managed super fund), society, strata or cooperative with an ABN or ACN."
            }
        ],
        "fees": [
            {
                "name": "Overseas ATM Fee",
                "feeType": "EVENT",
                "amount": "0.00",
                "currency": "AUD",
                "additionalInfo": "No Bankwest-charged overseas ATM access fees. The overseas bank may charge a fee for using their ATM."
            },
            {
                "name": "Paper Transaction Fee",
                "feeType": "EVENT",
                "amount": "0.00",
                "currency": "AUD"
            },
            {
                "name": "Electronic Transaction Fee",
                "feeType": "EVENT",
                "amount": "0.00",
                "currency": "AUD"
            },
            {
                "name": "Overdrawn Notice Fee",
                "feeType": "EVENT",
                "amount": "45.00",
                "currency": "AUD",
                "additionalInfo": "Overdrawn Notice Fee. This fee applies when your account is overdrawn without prior authorisation (ie there are insufficient funds or an authorised credit limit is exceeded), Bankwest elects to honour (pay) the transaction which overdraws your account and issues you with an Overdrawn Notice. Each Overdrawn Notice issued will incur a $45.00 fee."
            },
            {
                "name": "Honour Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "A $10.00 Honour Fee will apply when one or more transactions overdraw the account, Bankwest elects to honour (pay) the transaction(s), and Bankwest does not issue an Overdrawn Notice. A transaction will be taken to overdraw your account if it causes the balance to exceed the funds available in your account."
            },
            {
                "name": "Outward Dishonour Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "A $10.00 Outward Dishonour Fee will be charged to the account where there are insufficient cleared funds in your account to cover a cheque drawn on your account or an authorised debit request made in respect of your account."
            },
            {
                "name": "Inward Dishonour Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "A $10.00 Inward Dishonour Fee will be charged to the account where you deposit a cheque into your account which is not honoured by the financial institution on which the cheque is drawn."
            },
            {
                "name": "Search Fee",
                "feeType": "EVENT",
                "amount": "21.93",
                "currency": "AUD",
                "additionalInfo": "Fees will apply although each fee payable will not exceed the fee shown. These Search Fees are listed in our Bankwest Your Guide to Banking Fees brochure."
            },
            {
                "name": "Cheque Stop Payment",
                "feeType": "EVENT",
                "amount": "15.00",
                "currency": "AUD",
                "additionalInfo": "Fee to stop payment on an issued cheque. This fee is $25 when payment is stopped on a range of cheques."
            },
            {
                "name": "Management Fee",
                "feeType": "EVENT",
                "amount": "250.00",
                "currency": "AUD",
                "additionalInfo": "A quarterly Management Fee $250.00 (minimum) will be charged to the account at the end of March/June/September and December, and on termination if the account is terminated during a quarter."
            },
            {
                "name": "Inward Payment Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "We will charge a fee of $10.00 per transaction for each deposit via the Real Time Gross Settlement System and SWIFT Network."
            },
            {
                "name": "Duplicate Statement Fee",
                "feeType": "PERIODIC",
                "amount": "2.50",
                "currency": "AUD",
                "additionalInfo": "Customers requesting a duplicate paper statement to be printed (including faxes) will be charged a duplicate statement fee of $2.50 per statement."
            },
            {
                "name": "Foreign Transaction Fee",
                "feeType": "TRANSACTION",
                "transactionRate": "0.0295",
                "currency": "AUD",
                "additionalInfo": "We will charge a fee equal to 2.95% of the transaction amount for each transaction occurring outside Australia (whether in foreign currency or Australian dollars) posted to your account."
            },
            {
                "name": "AgriOne Package Establishment Fee",
                "feeType": "VARIABLE",
                "currency": "AUD",
                "additionalInfo": "A fee applies to establish the AgriOne package. The amount of the establishment fee is dependent upon the credit limit you apply for. We will provide details of any other fees, charges and expenses relevant to the establishment of your AgriOne Package at the time of approval."
            }
        ],
        "depositRates": [
            {
                "depositRateType": "VARIABLE",
                "rate": "0.0001",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalInfo": "Credit interest is usually paid monthly to the account; however annual interest payments can be made. We will credit this interest to your account on the last business day of the month. If you request annual interest payments we will credit this interest to you on the last business day of the month you have nominated."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.0747",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalInfo": "If an approved overdraft is held in the account, the applicable interest rate is the sum of the AgriOne Overdraft Reference Rate plus a margin dependant on the security offered. Interest is debited to the account on the last business day of each month."
            },
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.1197",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalInfo": "If the debit balance of the account exceeds the available balance, or if the account is overdrawn without prior arrangement, debit interest will be charged at the rate being the aggregate of the AgriOne Overdraft Reference Rate plus 4.50% p.a. Interest is debited to the account on the last business day of each month."
            }
        ],
        "productId": "78da232b377641ddb32b18cbc0cfab88",
        "effectiveFrom": "2000-03-31T14:00:00Z",
        "effectiveTo": "9999-12-30T13:00:00Z",
        "lastUpdated": "2022-11-11T00:35:30.386284Z",
        "productCategory": "TRANS_AND_SAVINGS_ACCOUNTS",
        "name": "AgriOne Account",
        "description": "A transaction account designed for primary producers, which combines with an Overdraft Facility (with a minimum credit limit of $100,000).",
        "brand": "Bankwest",
        "brandName": "Bankwest",
        "applicationUri": "https://www.bankwest.com.au/business/accounts",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.bankwest.com.au/business/accounts",
            "termsUri": "https://www.bankwest.com.au/business/accounts",
            "eligibilityUri": "https://www.bankwest.com.au/business/accounts",
            "feesAndPricingUri": "https://www.bankwest.com.au/business/accounts"
        }
    },
    "links": {
        "self": "https://open-api.bankwest.com.au/bwpublic/cds-au/v1/banking/products/78da232b377641ddb32b18cbc0cfab88"
    }
}