{
    "data": {
        "features": [
            {
                "featureType": "BILL_PAYMENT",
                "additionalValue": "BPAY Biller",
                "additionalInfo": "You can establish yourself as a BPAY biller, giving your customers the convenience and flexibility to make payments 24/7. They can make payments online or over the phone. Faster payments mean you can reduce the time and cost associated with managing collection of payments. Separate fees are applicable for this service and your use will be subject to a separate agreement with us."
            },
            {
                "featureType": "BILL_PAYMENT",
                "additionalValue": "Direct Debit Facility",
                "additionalInfo": "You can set up direct debits."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Bankwest Online Banking",
                "additionalInfo": "You can access this account in Bankwest Online Banking (BOB) and the Bankwest App."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Online Business Banking",
                "additionalInfo": "Enjoy secure Online Business Banking at your fingertips. As a customer on this account you may also be entitled to apply for our Online Business Banking service. If you apply for that service you will be provided with a separate Product Disclosure Statement and your use of the service will be a matter of separate agreement with us. Separate fees are applicable for this service."
            },
            {
                "featureType": "NPP_ENABLED",
                "additionalValue": "Yes",
                "additionalInfo": "This means you can receive faster payments into this account, often in real time. Keep in mind - this account isn't eligible for PayID."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Branch Access",
                "additionalInfo": "Over the counter transactions available at Bankwest branches."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Phone Banking",
                "additionalInfo": "You can bank over the phone."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Cheque Books",
                "additionalInfo": "Cheque access is available."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Facilities Availability",
                "additionalInfo": "Availability of these facilities is subject to compliance with the Property Occupations Act 2014."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Fee and Charges Redirection",
                "additionalInfo": "You must nominate another Bankwest-branded account to which we can debit fees and charges incurred in connection with the Trust Account."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Other Services",
                "additionalInfo": "Other fees which the Bank charges for its services, including services not specific to this account but for which you may be charged are listed in our Bankwest Your Guide to Banking Fees brochure."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Periodical Payments",
                "additionalInfo": "This service allows you to establish a recurring payment from your account to other accounts held with Bankwest or with another financial institution."
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_BALANCE",
                "additionalValue": "0.00",
                "additionalInfo": "The Trust Account cannot be overdrawn."
            },
            {
                "constraintType": "OPENING_BALANCE",
                "additionalValue": "0.00",
                "additionalInfo": "No minimum balance required to open the account."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "AU",
                "additionalInfo": "The business was established and has tax residency in Australia."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Real Estate Agents based in Queensland that are holding funds in trust in accordance with the Property Occupations Act 2014."
            }
        ],
        "fees": [
            {
                "name": "Paper Transaction Fee",
                "feeType": "EVENT",
                "amount": "0.60",
                "currency": "AUD",
                "discounts": [
                    {
                        "description": "The first 20 paper transactions per month are free, standard fee applies per transaction thereafter.",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "0.60",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "The first 20 paper transactions per month are free, standard fee applies per transaction thereafter."
                            }
                        ]
                    }
                ],
                "additionalInfo": "This account allows 20 free paper transaction per month. Each paper transaction over the fee free limit will incur a $0.60 fee. A paper transaction is any customer or third party initiated transaction in the form of a deposit or withdrawal including cheque deposit or withdrawal made at a Bankwest-branded Branch or Bank@Post or any deposit, cheque withdrawal and each cheque deposited. For example - A deposit to an account with two cheques will count as three transactions, one for the deposit (which is charged as a branch transaction) and one for each cheque lodged because each item requires individual processing. Additionally, one or more of the paper based service fees described in our Bankwest Your Guide to Banking Fees brochure will also apply each time a paper based service described in that brochure is provided. Each such service fee will apply regardless of whether a paper transaction fee described above is payable."
            },
            {
                "name": "Electronic Transaction Fee",
                "feeType": "EVENT",
                "amount": "0.25",
                "currency": "AUD",
                "discounts": [
                    {
                        "description": "The first 20 electronic transactions (where available) per month are free, standard fee applies per transaction thereafter (not payable for Online Business Banking transactions).",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "0.25",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "The first 20 electronic transactions (where available) per month are free, standard fee applies per transaction thereafter (not payable for Online Business Banking transactions)."
                            }
                        ]
                    }
                ],
                "additionalInfo": "This account allows 20 free electronic transactions per month. An electronic transaction is any transaction using electronic means that debits or credits the account. Each electronic transaction over the fee free limit will incur a $0.25 fee - however, this fee does not apply for an electronic transaction made using Online Business Banking (which is subject to separate agreement and separate fee regime). Electronic Fees are charged to the account on the first day of the following month. Additionally, one or more of the electronic based service fees described in our Bankwest Your Guide to Banking Fees brochure is provided. Each such service fee will apply regardless of whether an electronic transaction fee described above is payable."
            },
            {
                "name": "Outward Dishonour Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "An Outward Dishonour Fee will be charged to the account where there are insufficient cleared funds in your account to cover a cheque drawn on your account or an authorised debit request made in respect of your account."
            },
            {
                "name": "Inward Dishonour Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "An Inward Dishonour Fee will be charged to the account where you deposit a cheque into your account which is not honoured by the financial institution on which the cheque is drawn."
            },
            {
                "name": "Search Fees",
                "feeType": "EVENT",
                "amount": "21.93",
                "currency": "AUD",
                "additionalInfo": "Fees will apply although each fee payable will not exceed the fee shown. These Search Fees are listed in our Bankwest Your Guide to Banking Fees brochure."
            },
            {
                "name": "Cheque Stop Payment",
                "feeType": "EVENT",
                "amount": "15.00",
                "currency": "AUD",
                "additionalInfo": "Fee to stop payment on an issued cheque. This fee is $25 when payment is stopped on a range of cheques."
            },
            {
                "name": "Inward Payment Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "currency": "AUD",
                "additionalInfo": "We will charge a fee of $10.00 per transaction for each deposit via the Real Time Gross Settlement System and SWIFT Network."
            },
            {
                "name": "Maintenance Fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "currency": "AUD",
                "additionalValue": "P1M",
                "additionalInfo": "The account is free of Maintenance Fees."
            },
            {
                "name": "Duplicate Statement Fee",
                "feeType": "PERIODIC",
                "amount": "2.50",
                "currency": "AUD",
                "additionalInfo": "Customers requesting a duplicate paper statement to be printed (including faxes) will be charged a duplicate statement fee of $2.50 per statement."
            }
        ],
        "depositRates": [
            {
                "depositRateType": "VARIABLE",
                "rate": "0.01512",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalInfo": "Any interest earned on Real Estate Agent Trust - QLD is paid to the relevant state authority. Interest rates may be zero."
            }
        ],
        "productId": "f228afe43ee7490d999ded88a0ea5b5f",
        "effectiveFrom": "2006-12-31T13:00:00Z",
        "effectiveTo": "9999-12-30T13:00:00Z",
        "lastUpdated": "2022-10-02T23:08:50.314479Z",
        "productCategory": "REGULATED_TRUST_ACCOUNTS",
        "name": "Real Estate Agent Trust - QLD",
        "description": "The Real Estate Agent Trust is an account that allows Real Estate Agents to hold funds in trust. The Real Estate Agent Trust Account - QLD must be opened and operated within Queensland in accordance with the Property Occupations Act 2014.",
        "brand": "Bankwest",
        "brandName": "Bankwest",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.bankwest.com.au/business/accounts",
            "termsUri": "https://www.bankwest.com.au/business/accounts",
            "eligibilityUri": "https://www.bankwest.com.au/business/accounts",
            "feesAndPricingUri": "https://www.bankwest.com.au/business/accounts"
        }
    },
    "links": {
        "self": "https://open-api.bankwest.com.au/bwpublic/cds-au/v1/banking/products/f228afe43ee7490d999ded88a0ea5b5f"
    }
}