{
    "data": {
        "features": [
            {
                "featureType": "ADDITIONAL_CARDS",
                "additionalValue": "1",
                "additionalInfo": "Adding an additional cardholder is an easy way to share the convenience and accessibility of your CommBank credit card, without opening a new account. You can have one additional cardholder and they must be at least 16 years old. They'll get a card with their name but with your account number.",
                "additionalInfoUri": "https://www.commbank.com.au/support.credit-cards.add-additional-cardholder.html"
            },
            {
                "featureType": "BALANCE_TRANSFERS",
                "additionalValue": "Yes",
                "additionalInfo": "A balance transfer is when you request an amount owing on a personal Australian bank-issued credit card or store card to be transferred to your Commonwealth Bank credit card. This can help you save on interest charges and enables you to manage your finances in one spot. There is no fee charged to transfer the balance, however, interest will apply from the date of the transfer."
            },
            {
                "featureType": "BILL_PAYMENT",
                "additionalValue": "AutoPay",
                "additionalInfo": "Through AutoPay you can choose to have the full closing balance, minimum amount due or a set amount (assuming it's more than the minimum amount due and less than the full closing balance) directly debited from a CommBank transaction account.",
                "additionalInfoUri": "https://www.commbank.com.au/support.credit-cards.set-up-autopay.html"
            },
            {
                "featureType": "BILL_PAYMENT",
                "additionalValue": "BPAY View",
                "additionalInfo": "See, track and easily pay your bills online in NetBank or on the go in the CommBank app.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/bpay-view.html"
            },
            {
                "featureType": "BONUS_REWARDS",
                "additionalValue": "80000",
                "additionalInfo": "Earn up to 80,000 CommBank Awards points or up to 40,000 Qantas Points. Earn 20,000 CommBank Awards points or 10,000 Qantas Points each month when you spend $1,500 or more per month for the first four months. This offer applies to applications submitted between 01/10/2023 - 29/02/2024.",
                "additionalInfoUri": "https://www.commbank.com.au/credit-cards/smart-awards.html"
            },
            {
                "featureType": "COMPLEMENTARY_PRODUCT_DISCOUNTS",
                "additionalValue": "Mastercard Travel Pass provided by DragonPass",
                "additionalInfo": "Enjoy access to over 1,300 airport lounges worldwide for a fee with Mastercard Travel Pass provided by DragonPass with your Smart Awards credit card.",
                "additionalInfoUri": "https://mastercardtravelpass.dragonpass.com/"
            },
            {
                "featureType": "COMPLEMENTARY_PRODUCT_DISCOUNTS",
                "additionalValue": "Priceless Cities",
                "additionalInfo": "A program available exclusively to Mastercard cardholders that provides access to unforgettable experiences in the cities where you live and travel.",
                "additionalInfoUri": "https://www.priceless.com/"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalValue": "Yes",
                "additionalInfo": "Wherever you are in the world, CommBank gives you the choice and control to securely manage all of your accounts on a range of devices, the way you want.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Apple Pay",
                "additionalInfo": "Pay with your Apple(TM) device using Apple Pay.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/mobile-payments-wearables/apple-pay.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "CommBank Tap and Pay",
                "additionalInfo": "Pay with your Android(TM) phone using the CommBank app.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/tap-and-pay.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Fitbit Pay",
                "additionalInfo": "Pay with your Fitbit(TM) smartwatch using Fitbit Pay.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/mobile-payments-wearables/fitbit-pay.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Garmin Pay",
                "additionalInfo": "Pay with your Garmin(TM) smartwatch using Garmin Pay.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/mobile-payments-wearables/garmin-pay.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Google Pay",
                "additionalInfo": "Pay with your Android(TM) device using Google Pay(TM).",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/mobile-payments-wearables/google-pay.html"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Samsung Pay",
                "additionalInfo": "Pay with your Samsung(TM) device using Samsung Pay.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/mobile-payments-wearables/samsung-pay.html"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Extended warranty insurance",
                "additionalInfo": "Extends the manufacturer's Australian warranty on most purchases by up to a year. This is provided the purchase is charged to the cardholder's eligible credit card account or is purchased by redeeming Commonwealth Awards points. Restrictions, exclusions, limits, sub-limits and excesses may apply. Refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full details.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Interstate Flight Inconvenience",
                "additionalInfo": "Cover provided for flight delays, delayed luggage, lost or damaged items while travelling inside Australia. For a set period per trip when you activate your cover. Restrictions, exclusions (including for pre-existing medical conditions and persons aged 80 years or over) limits, sub-limits and excesses may apply. Refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full details.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Price Guarantee",
                "additionalInfo": "Cover provided for the difference in price of a purchase if the same business item or personal good is advertised for a lower price in store within 21 days of purchase, within 25 kilometres of the store it was purchased. Provided the price difference is greater than $75, we will refund the price difference up to a maximum amount of $500 for any one item, set or pair items (including attached and unattached accessories). This is subject to conditions, exclusions, limits, sub-limits and terms. Refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full details.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Purchase security insurance",
                "additionalInfo": "Covers the repair or replacement cost of goods that are lost, stolen or damaged within 90 days of most purchases. When those items are charged to the cardholder's eligible credit card account or purchased by redeeming Commonwealth Awards points. Restrictions, exclusions, limits, sub-limits and excesses may apply. Refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full details.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Transit Accident Insurance",
                "additionalInfo": "Cover for accidental death or specific serious injuries sustained while riding as a paying passenger on licensed buses, trains or planes or international passage outside Australia where that trip cost has been paid for entirely on an eligible card. For a set period per trip when you activate your cover. Restrictions, exclusions (including for pre-existing medical conditions and persons aged 80 years or over) limits, sub-limits and excesses may apply. Refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full details.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "International travel insurance",
                "additionalInfo": "International travel insurance included on your credit card provides cover for you, your spouse and your accompanied children for return trips from Australia, up to a set period. You will need to activate your travel insurance for each trip in order to have a comprehensive level of cover. To activate your cover, register on NetBank, the CommBank app or call Cover-More on 1300 467 951 before you travel. If you don't activate you'll receive Base medical which includes personal liability cover and unlimited overseas emergency medical assistance and hospital expenses only. Terms, conditions, restrictions, exclusions (including for pre-existing medical conditions and persons aged 80 years or over), limits, sub-limits and excesses apply. Before making a decision, refer to the Credit Card Insurances Product Disclosure Statement and Information Booklet for full conditions. Insurance products listed are issued and administered by Cover-More Insurance Services Pty Ltd (AFSL 241713, ABN 95 003 114 145) on behalf of the insurer Zurich Australian Insurance Limited (AFSL 232507, ABN 13 000 296 640) for Commonwealth Bank of Australia (CBA). CBA and its related bodies corporate do not issue or guarantee this insurance. It does not represent a deposit with or liability of either CBA or any of its related bodies corporate. We do not provide any advice on this insurance based on any consideration of your objectives, financial situation or needs. If you purchase an upgrade policy, we (CBA) receive a commission which is a percentage of your premium. More information can be found here.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank-assets/important-docs/credit-card-insurances-pds-info-booklet.pdf"
            },
            {
                "featureType": "INTEREST_FREE",
                "additionalValue": "P55D",
                "additionalInfo": "Up to 55 days. We won't charge any interest on purchases if you pay at least the closing balance shown on your statement by the due date each and every month.",
                "additionalInfoUri": "https://www.commbank.com.au/credit-cards/credit-card-interest.html"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Varies",
                "additionalInfo": "Earn Bonus Points for every dollar you spend on your Awards credit cards when you shop with our bonus partners. The best part is there's no cap on how many bonus points you can earn.",
                "additionalInfoUri": "https://www.commbank.com.au/credit-cards/awards-program.html"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "CommBank Awards program",
                "additionalInfo": "Earn up to 2 Bonus Points or 0.8 Qantas Points per $1 spent on your highest eligible purchase made in a statement period up to 1,000 Bonus Points or 400 Qantas Points.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank/personal/apply-online/download-printed-forms/CommonwealthAwards.pdf"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Point of Sale Redemption",
                "additionalInfo": "Redeem exclusively in-store at Myer and Flight Centre or choose from a range of items on the Awards site - including Gift Cards, electronics, appliances, cash back and much more.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank/personal/apply-online/download-printed-forms/CommonwealthAwards.pdf"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Points Plus Pay",
                "additionalInfo": "If you see something you love in our CommBank Awards program, but don't have enough points, you can select Points Plus Pay. This lets you use the points you have and pay the remaining balance on your credit card.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank/personal/apply-online/download-printed-forms/CommonwealthAwards.pdf"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Smart Awards Points Earn Structure",
                "additionalInfo": "Earn up to 1.5 Awards points or 0.6 Qantas Points per $1 spent at major Australian supermarkets, department stores, petrol stations, dining (cafes, restaurants & fast food) and utilities (electricity, gas & water). Earning these points depends on how the merchant categorises their business and provide us this information (directly or through their financial institution). You're unable to get these points if you use an intermediary platform such as PayPal for these transactions. Earn up to 1 Awards point or 0.4 Qantas Points for every $1 spent on all other purchases. Once you have spent $5,000 in any given statement period, you will earn 0.5 Awards points or 0.2 Qantas Points for every dollar you spend on any other purchases within that period. Points Boost: earn up to 2 Bonus Points per $1 spent on your highest eligible transaction (not exceeding $500) made in a statement period up to 1,000 Bonus Points.",
                "additionalInfoUri": "https://www.commbank.com.au/content/dam/commbank/personal/apply-online/download-printed-forms/CommonwealthAwards.pdf"
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Billing notifications",
                "additionalInfo": "We'll tell you when your online bill payment is due.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/bpay-view.html"
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Overlimit notifications",
                "additionalInfo": "Sends message to customer to inform them their card is over limit and to make payment to reduce limit and prevent an over limit fee from being charged to the account."
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Payment reminders",
                "additionalInfo": "Reminders before payments are due to avoid late fees."
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Transaction Notifications",
                "additionalInfo": "Turn Transaction Notifications on in the CommBank app and we'll instantly alert you when you pay using your CommBank credit card, and when you receive money into your everyday account.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/transaction-notifications.html"
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Lock, Block, Limit",
                "additionalInfo": "Instantly lock, block or limit your credit card for extra control through the CommBank app or NetBank.",
                "additionalInfoUri": "https://www.commbank.com.au/personal/credit-cards/lock-block-limit.html"
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Spend Tracker & Insights",
                "additionalInfo": "We help you stay on track with your credit card spending in the CommBank app.",
                "additionalInfoUri": "https://www.commbank.com.au/digital-banking/spend-tracker-insights.html"
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Mastercard Zero Liability",
                "additionalInfo": "Free protection against fraud and other unauthorised transactions with Mastercard Zero Liability.",
                "additionalInfoUri": "https://www.mastercard.com.au/en-au/about-mastercard/what-we-do/terms-of-use/zero-liability-terms-conditions.html"
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Spending Cap",
                "additionalInfo": "Setting a Spending Cap helps you keep on top of your spend. Plus you can still access additional funds if you need them.",
                "additionalInfoUri": "https://www.commbank.com.au/credit-cards/manage/spending-cap.html"
            },
            {
                "featureType": "OTHER",
                "additionalValue": "SurePay instalment plans",
                "additionalInfo": "Take control of your credit card repayments and break down a large credit card purchase or balance into fixed monthly instalments over a set term.",
                "additionalInfoUri": "https://www.commbank.com.au/credit-cards/surepay-instalment-plans.html"
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "3000.00",
                "additionalInfo": "Note that the credit limit we give you will depend on your ability to meet your repayments."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "MIN_AGE",
                "additionalValue": "18",
                "additionalInfo": "The additional cardholder may be 16 years of age or older."
            },
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "AU",
                "additionalInfo": "Available to citizens or permanent residents of Australia and valid visa holders. Make sure you are legally allowed to work in Australia."
            },
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "NZ",
                "additionalInfo": "Available to citizens or permanent residents of NZ and valid visa holders. Make sure you are legally allowed to work in Australia."
            },
            {
                "eligibilityType": "NATURAL_PERSON",
                "additionalInfo": "Individuals must have the legal capacity to enter into the loan contract. Not available for non-personal borrowers."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Each application for credit is assessed on the ability of the applicant to service debt (limit) based on the financials supplied in the application."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Applications for credit cards are subject to credit approval."
            }
        ],
        "fees": [
            {
                "name": "Late payment fee",
                "feeType": "EVENT",
                "amount": "20.00",
                "currency": "AUD",
                "additionalInfo": "When you don't make your minimum monthly payment, plus any overdue amount, by your statement due date."
            },
            {
                "name": "Emergency issue/ lost/ replacement card fee",
                "feeType": "EVENT",
                "amount": "20.00",
                "currency": "AUD",
                "additionalInfo": "When you need an emergency replacement card delivered to you."
            },
            {
                "name": "Additional cardholder fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "currency": "AUD",
                "additionalValue": "P1Y",
                "additionalInfo": "Pay no additional cardholder fee to share the convenience of your card with someone else."
            },
            {
                "name": "Qantas Frequent Flyer Opt-In fee",
                "feeType": "PERIODIC",
                "amount": "60.00",
                "currency": "AUD",
                "additionalValue": "P1Y",
                "additionalInfo": "There is a $60 annual fee charged for opting in. Once a customer has opted in to Qantas Frequent Flyer Direct, all CommBank Awards points earned after opting in will be automatically redeemed for Qantas Points and transferred monthly to their Qantas Frequent Flyer account at the applicable conversion rate."
            },
            {
                "name": "Monthly Fee",
                "feeType": "PERIODIC",
                "amount": "19.00",
                "currency": "AUD",
                "discounts": [
                    {
                        "description": "Monthly fee waiver if eligibility criteria is met.",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "19.00",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "No monthly fee if you spend at least $2,000 on your Smart Awards credit card in your statement period. Otherwise the monthly fee is $19."
                            }
                        ]
                    }
                ],
                "additionalValue": "P1M",
                "additionalInfo": "Payable each month, giving you access to the features and benefits of your credit card."
            },
            {
                "name": "International transacton fee (Mastercard transactions)",
                "feeType": "TRANSACTION",
                "amount": "0.00",
                "currency": "AUD",
                "additionalInfo": "Pay no international transaction fees for purchases you make overseas or online. For international cash advances, the cash advance fee will apply."
            },
            {
                "name": "Cash Advance Fee",
                "feeType": "WITHDRAWAL",
                "transactionRate": "0.03",
                "currency": "AUD",
                "additionalInfo": "This is charged for cash advances from Commbank branches or other Australian financial institutions, ATMs, overseas terminals or financial institutions, funds transfers using CommBank networks and purchases of cash equivalent items, such as gambling, lottery tickets and money transfers. Capped at a maximum fee of $300.00 (or $4.00 if your closing balance was in credit the previous business day)."
            },
            {
                "name": "Cash Advance Fee",
                "feeType": "WITHDRAWAL",
                "amount": "4.00",
                "currency": "AUD",
                "additionalInfo": "This is charged for cash advances from Commbank branches or other Australian financial institutions, ATMs, overseas terminals or financial institutions, funds transfers using CommBank networks and purchases of cash equivalent items, such as gambling, lottery tickets and money transfers. Capped at a maximum fee of $300.00 (or $4.00 if your closing balance was in credit the previous business day)."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "FIXED",
                "rate": "0.0599",
                "calculationFrequency": "P1D",
                "tiers": [
                    {
                        "name": "Term",
                        "unitOfMeasure": "MONTH",
                        "minimumValue": 0,
                        "maximumValue": 5
                    }
                ],
                "additionalValue": "P5M",
                "additionalInfo": "Balance Transfer Rate"
            },
            {
                "lendingRateType": "PURCHASE",
                "rate": "0.2024",
                "calculationFrequency": "P1D"
            },
            {
                "lendingRateType": "CASH_ADVANCE",
                "rate": "0.2199",
                "calculationFrequency": "P1D"
            }
        ],
        "productId": "ff7e709bc7f8414da253f9c10308fe24",
        "effectiveFrom": "2023-02-02T13:00:00Z",
        "effectiveTo": "9999-12-30T13:00:00Z",
        "lastUpdated": "2023-10-12T15:15:14.880753Z",
        "productCategory": "CRED_AND_CHRG_CARDS",
        "name": "Smart Awards credit card",
        "description": "A credit card that allows you to earn unlimited awards points, extra bonus points, travel benefits and ability to pay no monthly fee for eligible customers.",
        "brand": "CBA",
        "brandName": "CommBank",
        "applicationUri": "https://www.commbank.com.au/credit-cards/smart-awards.html",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.commbank.com.au/credit-cards/smart-awards.html",
            "termsUri": "https://www.commbank.com.au/content/dam/commbank/personal/apply-online/download-printed-forms/cc2-cou.pdf",
            "eligibilityUri": "https://www.commbank.com.au/credit-cards/smart-awards.html",
            "feesAndPricingUri": "https://www.commbank.com.au/personal/apply-online/download-printed-forms/ADB1682.pdf"
        }
    },
    "links": {
        "self": "https://api.commbank.com.au/public/cds-au/v1/banking/products/ff7e709bc7f8414da253f9c10308fe24"
    }
}