{
    "data": {
        "productId": "CCAltBlackRewards",
        "lastUpdated": "2022-12-08T06:15:27Z",
        "productCategory": "CRED_AND_CHRG_CARDS",
        "name": "Altitude Rewards Black",
        "description": "Our premier Altitude Rewards credit card gets you our highest Altitude Points earn rate as well as complimentary airport lounge access, insurances and concierge.",
        "brand": "Westpac",
        "brandName": "Westpac",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.westpac.com.au/personal-banking/credit-cards/reward/altitude-black/",
            "termsUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/pb/Consumer_Conditions_of_use.pdf",
            "eligibilityUri": "https://www.westpac.com.au/personal-banking/credit-cards/reward/altitude-black/",
            "feesAndPricingUri": "https://www.westpac.com.au/personal-banking/credit-cards/reward/altitude-black/"
        },
        "cardArt": [
            {
                "imageUri": "https://www.westpac.com.au/content/dam/public/wbc/images/personal/credit-cards/wbc_misc_p_credit-cards_altitude-black_588x383.png",
                "title": "Altitude Rewards Black Card"
            }
        ],
        "features": [
            {
                "featureType": "ADDITIONAL_CARDS",
                "additionalValue": "1",
                "additionalInfo": "Earn points faster by adding one additional cardholder (16 years or older) at no extra cost."
            },
            {
                "featureType": "INTEREST_FREE_TRANSFERS",
                "additionalValue": "P24M",
                "additionalInfo": "Balance Transfer Offer: 0% p.a. for 24 months on balance transfers When requested at card application. 1% balance transfer fee applies. After 24 months the rate reverts to the variable cash advance rate."
            },
            {
                "featureType": "INTEREST_FREE",
                "additionalValue": "P45D"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "20th Anniversary 2 Million Points Competition: The Prize consists of 2 Million Altitude Reward Points, which can be redeemed for an estimated value of $8,000.  Entry is open to all Australian residents aged 18 years or over who are entered in the Westpac Altitude Rewards Programme. Entry to the Promotion is automatic. Promotion opens 12.01am AEST on 1.8.22 and closes 11.59pm AEDT on 31.12.22.  For more information use the link given below.",
                "additionalInfoUri": "https://www.altituderewards.com.au/rewards/phoenix/altitude/ProgramInfo/altitudewelcome"
            },
            {
                "featureType": "DIGITAL_BANKING"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Tap & go Mastercard, Fitbit Pay, Apple pay, Google Pay and Samsung Pay.",
                "additionalInfo": "Tap and pay quickly and easily using Tap & go Mastercard, Fitbit Pay,Applepay, Google Pay and Samsung Pay."
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Know what to pay when - Set up Card Autopay or SMS payment reminders so you can stay on top of your spend and repayments."
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Altitude Rewards",
                "additionalInfo": "1.25 Altitude Points per dollar spent on eligible purchases"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Altitude Rewards",
                "additionalInfo": "Earn 2 Points per dollar spent at Spotify Premium, David Jones, Myer, THE ICONIC, Airbnb, Uber and Uber Eats."
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "Altitude Rewards",
                "additionalInfo": "Earn 6 points per dollar on Qantas, Jetstar, Singapore Airlines and Emirates flights bought in Australia, eligibility criteria applies."
            },
            {
                "featureType": "INSURANCE",
                "additionalValue": "Complimentary insurance",
                "additionalInfo": "Complimentary cover for overseas travel, extended warranty, purchase security transit accidents, subject to the terms and conditions set out in the Westpac Credit Cards Complimentary Insurance Policy.",
                "additionalInfoUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/pb/credit-cards/WBC_Consumer_Credit_Card_Comp_Insurance_Allianz.pdf"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Dedicated Westpac Concierge services are on-call 24/7 to fulfil your requests, from restaurant bookings and party planning, to tickets to your favourite game."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Uncapped rewards - The sky's the limit with no cap on earning points. Plus, earn points faster by adding one additional cardholder at no extra cost."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Use our SmartPlan repayment planner to break large purchases or balances down into regular instalments while keeping interest-free days."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Westpac Fraud Money Back Guarantee ensures that any unauthorised transaction claims will be reimbursed provided that the cardholder has not contributed to the loss and contacted us promptly."
            },
            {
                "featureType": "COMPLEMENTARY_PRODUCT_DISCOUNTS",
                "additionalValue": "Enjoy up to 2 complimentary Priority Pass Airport lounge passes per year. Please visit FAQ in overview link for more details"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Earn bonus Cashback when you shop via the new Westpac Lounge on ShopBack. Terms & Conditions applies."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Westpac Extras",
                "additionalInfo": "Enjoy cashback to your account on eligible transactions from well-known and loved brands ? from department stores and supermarkets to petrol stations, travel partners and more. Subject to Terms & Conditions, eligibility criteria applies"
            },
            {
                "featureType": "BONUS_REWARDS",
                "additionalValue": "140000",
                "additionalInfo": "Earn 140,000 bonus Altitude Points with $6000 spend on eligible purchases within 120 days of card approval. You can redeem 140,000 Altitude Points for $590 in eGift cards at a range of retailers or choose merchandise from our online store."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Minimum repayments : 2% of the closing balance outstanding, or $10; whichever is greater. If the closing balance is less than $10, it must be paid in full."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You can use your Card to make a Purchase or a Cash Advance or carry out a Balance Transfer from another Credit Card. You can use your Card in many places in Australia and around the world. Look for the Visa and Mastercard signs that match those shown on your Card. If your Card is accepted by a Merchant, branch or ATM provider you can use it to: Pay for Purchases, through payment terminals, e.g. at a shop, etc.  online, within a mobile app, by telephone,  through mail order Withdraw Cash, at an ATM,  at a Bank branch."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Recurring payments - You may authorise a Merchant to charge recurring payments to your Card automatically without requesting your authorisation on each occasion."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Confirming and authorising transactions :  There are a number of ways you may be able to confirm a transaction. These include: signing your name. Holding your Card in  front of a contactless payment device. Entering your PIN. Entering your Card details and any other information required."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Gambling blocks : If you wish to limit access to gambling services through the Card Account, please call us or log into your online banking and activate gambling block in the Card Services menu."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Statements : We will issue a statement for the Card Account to you every month unless the account has a balance of $10 or less and there has been no account activity in that month. You can choose to receive statements by mail or electronically."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Tracking your points balance:  Your Card statement will show for the period covered - your Altitude Points balance, including Points earned "
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Make shopping and ordering online even more safe and secure with Westpac My Merchants. Westpac My Merchants lets you shop and order online without needing to share your card details, because your card number is replaced with a unique identification code called a 'digital token'. This digital token, which won't contain your personal information and is used by the merchant instead of your card number, helping protect you online.",
                "additionalInfoUri": "https://www.westpac.com.au/personal-banking/mobile-wallets/my-merchants/"
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "15000.00"
            },
            {
                "constraintType": "MAX_LIMIT",
                "additionalValue": "75000.00"
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "MIN_AGE",
                "additionalValue": "18",
                "additionalInfo": "18+ years old"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Those having permanent residency in Australia/NZ OR being a non-resident or migrant and hold an acceptable Visa, with a minimum 1 year before expiry"
            },
            {
                "eligibilityType": "MIN_INCOME",
                "additionalValue": "75000.00",
                "additionalInfo": "Earn a minimum $75,000 per annum"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Customer having a regular, verifiable Australian taxable income."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Customer having a fixed, verifiable residential address in Australia."
            }
        ],
        "fees": [
            {
                "name": "Annual Card Fee",
                "feeType": "PERIODIC",
                "amount": "250.00",
                "additionalValue": "P1Y",
                "additionalInfo": "$250 annual card fee",
                "discounts": [
                    {
                        "description": "Reduced First year Card Fee",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "100.00",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "The discounted first year card fee of $150 is available when you apply and are approved for a new Altitude Black credit card. After the first year, the $250 annual card fee will be debited to your account annually on the 12-month anniversary of the first transaction on your card account. If you are already a Westpac Customer, Sign in to apply for a $99 annual card fee for the first year. "
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Foreign transaction fee",
                "feeType": "TRANSACTION",
                "transactionRate": "0.03",
                "additionalInfo": "Payable as a percentage of the Australian dollar value of any foreign transaction.\nApplies for transactions in a foreign currency, or in Australian dollars but processed by an overseas merchant or financial institution.\nNote: It may not always be clear to you that the Merchant or entity processing the transaction is located outside Australia."
            },
            {
                "name": "Cash Advance Fee",
                "feeType": "TRANSACTION",
                "transactionRate": "0.03"
            },
            {
                "name": "Missed Payment Fee",
                "feeType": "EVENT",
                "amount": "15.00",
                "additionalInfo": "$15 each statement cycle that the minimum monthly payment is not paid by the statement due date."
            },
            {
                "name": "Over-Limit Fee",
                "feeType": "EVENT",
                "amount": "15.00",
                "additionalInfo": "Debited from the customer?s credit card account if they exceed the customer?s credit limit during a statement cycle. This fee is only for credit card accounts opened before 4 June 2012"
            },
            {
                "name": "Annual rewards program fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "additionalValue": "P1Y"
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "PURCHASE",
                "rate": "0.1999",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalValue": "Interest on purchases"
            },
            {
                "lendingRateType": "CASH_ADVANCE",
                "rate": "0.2149",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "additionalValue": "Interest on cash advances"
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/CCAltBlackRewards"
    },
    "meta": {}
}