{
    "data": {
        "productId": "CCFlex",
        "lastUpdated": "2023-06-26T06:33:52Z",
        "productCategory": "CRED_AND_CHRG_CARDS",
        "name": "Flex Card",
        "description": "Flex Card is a simple, affordable, interest-free way to pay for the unexpected, as well as the things you want. And, best of all, it is accepted everywhere - both in-store and online.",
        "brand": "Westpac",
        "brandName": "Westpac",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.westpac.com.au/personal-banking/credit-cards/interest-free/flex-card/",
            "termsUri": "https://www.westpac.com.au/personal-banking/credit-cards/interest-free/flex-card/",
            "eligibilityUri": "https://www.westpac.com.au/personal-banking/credit-cards/interest-free/flex-card/",
            "feesAndPricingUri": "https://www.westpac.com.au/personal-banking/credit-cards/interest-free/flex-card/"
        },
        "cardArt": [
            {
                "imageUri": "https://www.westpac.com.au/content/dam/public/wbc/images/personal/credit-cards/wbc_misc_p_credit-cards-selector-flex-coming-soon_170x138.png",
                "title": "Flex Card"
            }
        ],
        "features": [
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Easy management with the Westpac App : You can - Quickly check your balance and track how much you have repaid, update your repayments to suit your needs, transfer from your linked account and access the Westpac Rewards and Offers Hub."
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Apple pay, Google Pay, Samsung Pay, Garmin pay and Fitbit.",
                "additionalInfo": "Flex Card comes as a Digital Card, which you can access anytime, anywhere via the Westpac App. It is a digital version of your card, but instantly available 24/7 in the Westpac App. Use it to shop online, pay bills, make in-app purchases and set up your recurring card payments, or even add it to your mobile or wearable wallet to shop in-store."
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Westpac Protect SMS Code : An optional extra layer of protection to authorise certain transactions."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Make shopping and ordering online even more safe and secure with Westpac My Merchants. Westpac My Merchants lets you shop and order online without needing to share your card details, because your card number is replaced with a unique identification code called a 'digital token'. This digital token, which won't contain your personal information and is used by the merchant instead of your card number, helping protect you online.",
                "additionalInfoUri": "https://www.westpac.com.au/personal-banking/mobile-wallets/my-merchants/"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "0% interest and no late payment fees - just a simple $10 monthly fee (for any outstanding balance)."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You are in control of repayments. Choose monthly or twice-monthly repayments, with the option to pay back more at any time by simply transferring funds from your linked account."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Fraud Money Back Guarantee : You are completely covered with fraud protection. If you did not contribute to the loss and contact us straight away, you will be reimbursed for unauthorised transactions."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Enjoy access to Westpac Extras, Rewards and Offers Hub. With Westpac Extras you get regularly updated cashback offers for in-store and online shopping with some of your favourite brands, while Rewards and Offers Hub brings you deals and offers just for being a cardholder. Sign into Online Banking or the Westpac App to explore your offers."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Earn bonus Cashback when you shop via the new Westpac Lounge on ShopBack. Terms & Conditions applies."
            },
            {
                "featureType": "OTHER",
                "additionalValue": "Westpac Extras\n",
                "additionalInfo": "Enjoy cashback to your account on eligible transactions from well-known and loved brands ? from department stores and supermarkets to petrol stations, travel partners and more. Subject to Terms & Conditions, eligibility criteria applies"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Never miss a repayment with Autopay. You can set auto-repayments to the minimum monthly repayment ($40) or full amount to suit however you manage your money."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Minimum monthly repayment of $40"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Flex's is a digital card first, instantly available 24/7 via the Westpac App or your device's digital wallet. You can use it anywhere that takes MasterCard  not just 'participating retailers'.  You can also get a plastic card by making an order of physical card in the Westpac app."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Digital CVC : A 3-digit security number (CVC) that refreshes every 24 hours to help keep your details safe"
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "1000.00"
            },
            {
                "constraintType": "MAX_LIMIT",
                "additionalValue": "1000.00"
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "MIN_AGE",
                "additionalValue": "18",
                "additionalInfo": "You should be aged 18 or over"
            },
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "You have a fixed residential address in Australia"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "You are an Australian citizen or permanent resident"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "You have a regular, verifiable Australian income from the same source for at least 3 months"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "You have an eligible Australian bank account."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "You?re up-to-date with all your regular payments (rent, phone, other credit cards or loans including afterpay etc.)"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "You haven?t made another application for Flex in the last 90 days."
            }
        ],
        "fees": [
            {
                "name": "Monthly Fee",
                "feeType": "PERIODIC",
                "amount": "10.00",
                "additionalValue": "P1M",
                "additionalInfo": "If there is no outstanding balance, no fee is charged to your account. A simple $10 fee will be applied to your account if you don't pay the outstanding balance on your previous statement by the due date."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "PURCHASE",
                "rate": "0.00",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS"
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/CCFlex"
    },
    "meta": {}
}