{
    "data": {
        "productId": "HLPremiumOptionHomeloan",
        "lastUpdated": "2023-06-27T04:31:23Z",
        "productCategory": "RESIDENTIAL_MORTGAGES",
        "name": "Premium Options Home Loan",
        "description": "A variable rate home loan which gives flexibility and a choice of different payment options for owner occupied or personal purposes.",
        "brand": "Westpac",
        "brandName": "Westpac",
        "isTailored": false,
        "additionalInformation": {},
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "A variable rate loan which gives flexibility and a choice of different payment options for owner occupied purposes. The loan can be used for owner occupied residential property purchase, construction of single residential dwelling, refinancing of an existing owner occupied property loan, other investment opportunities (excluding investment property), personal purposes, refinancing of existing loans (debt consolidation)"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "This loan can be part of a combination loan"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "The product provides options which includes portability, progressive drawdown, repayment holiday, top-up, parental leave, reduced payment, extra repayments, lenders mortgage insurance."
            },
            {
                "featureType": "COMPLEMENTARY_PRODUCT_DISCOUNTS",
                "additionalValue": "You save on fees when you choose the Premier Advantage Package, however an annual package fee of $395 applies.",
                "additionalInfoUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/pb/PAP_ConditionsofUse.pdf"
            },
            {
                "featureType": "REDRAW",
                "additionalInfo": "Redraw of repaid principal above minimum required is available"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Substituting a security : You may ask us to accept a new mortgage over other land as a substitute for any mortgage which is security for your loan. We may agree to this if you satisfy any reasonable requirements that we have, such as repaying part of the loan amount. We will require the new mortgage to be provided at the same time that the existing mortgage is discharged. We charge a fee for substituting a mortgage or other security."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Statements of account : We will send you a statement of your loan account at least every six months or more frequently if you request"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Maximum loan term is up to 30 years"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Package can include the following : 1. Package residential home and investment loans 2. Package Portfolio Loan  3. Package full interest offset facility 4. Package credit card 5. Package Insurance"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Cancellation of the package : A package owner may cancel the package at any time by giving us 14 days advance notice in writing."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Building Loan Feature: A specialised lending option that is available on selected Westpac loan products. Allows the customer to progressively draw down what is needed to cover the build of their residential property over the construction period."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Applicants can be Individuals, Discretionary or Family Trusts Companies (only available if property is occupied by company directors or beneficiaries of the trust that is not trustees)"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "This loan is only available for owner occupied purposes only that is for Purchase or refinance of Owner Occupied property, Construction/renovations/home improvements, Other investments (excluding investment property), Debt consolidation and Personal use"
            }
        ],
        "fees": [
            {
                "name": "Lending Establishment Fee",
                "feeType": "UPFRONT",
                "amount": "600.00",
                "discounts": [
                    {
                        "description": "This fee is waived for customers that have Premier Advantage Package (other fees apply)",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "600.00",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "With Premier Advantage Package and for Investor loans customer with Principal and Interest repayments"
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Guarantor Fee",
                "feeType": "EVENT",
                "amount": "200.00"
            },
            {
                "name": "Bank Cheque Issuance Fee",
                "feeType": "EVENT",
                "amount": "10.00",
                "additionalInfo": "$10 per cheque (1st cheque is free)"
            },
            {
                "name": "Loan Account Fee",
                "feeType": "PERIODIC",
                "amount": "8.00",
                "additionalValue": "P1M",
                "discounts": [
                    {
                        "description": "This fee is waived for customers that have Premier Advantage Package (other fees apply)",
                        "discountType": "ELIGIBILITY_ONLY",
                        "amount": "8.00",
                        "eligibility": [
                            {
                                "discountEligibilityType": "OTHER",
                                "additionalInfo": "With Premier Advantage Package"
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Missed Payment Fee",
                "feeType": "EVENT",
                "amount": "15.00"
            },
            {
                "name": "Document Processing Fee",
                "feeType": "EVENT",
                "amount": "150.00"
            },
            {
                "name": "Default Notice Fee",
                "feeType": "EVENT",
                "amount": "85.00"
            },
            {
                "name": "Mortgage Insurance Administration Fee",
                "feeType": "EVENT",
                "amount": "90.00"
            },
            {
                "name": "Account Overdrawn Fee",
                "feeType": "EVENT",
                "amount": "15.00"
            },
            {
                "name": "Loan Discharge Fee",
                "feeType": "EVENT",
                "amount": "350.00"
            },
            {
                "name": "Annual Package Fee",
                "feeType": "PERIODIC",
                "amount": "395.00",
                "additionalValue": "P1Y",
                "additionalInfo": "For customer opting for Premier Advantage Package"
            },
            {
                "name": "Lenders Mortgage Insurance Premium",
                "feeType": "VARIABLE",
                "additionalInfo": "If your deposit is less than 20% then Lenders Mortgage Insurance is usually required. There may be other circumstances where Lenders Mortgage Insurance is also required. As Lenders Mortgage Insurance reduces bank's risk as a lender when providing a home loan, you may be able to apply for a home loan and get into your home sooner, with a lower deposit. Lenders Mortgage Insurance insures bank for any shortfall in the event that you default on your loan and if the proceeds from the property sale are not enough to pay off the loan in full. The cost of Lenders Mortgage Insurance is calculated as a percentage of the loan amount. The percentage applied will vary depending on a number of factors. Please speak to your lender if you would like to understand this process in more detail. The cost of Lenders Mortgage Insurance premium is passed on to you. We do not receive a commission on Lenders Mortgage Insurance."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.0458",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS",
                "repaymentType": "PRINCIPAL_AND_INTEREST",
                "loanPurpose": "INVESTMENT",
                "additionalInfo": "With Principal and Interest repayment."
            },
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.0517",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS",
                "repaymentType": "INTEREST_ONLY",
                "loanPurpose": "INVESTMENT",
                "additionalInfo": "With Interest Only repayment."
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/HLPremiumOptionHomeloan"
    },
    "meta": {}
}