{
    "data": {
        "productId": "SecuredBusinessLoan",
        "lastUpdated": "2024-07-01T04:17:11Z",
        "productCategory": "BUSINESS_LOANS",
        "name": "Secured Business Loan",
        "description": "Make your business plans happen with a Westpac business loan.",
        "brand": "Westpac",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.westpac.com.au/business-banking/loans-finance/business-loan/",
            "termsUri": "https://www.westpac.com.au/business-banking/loans-finance/business-loan/",
            "eligibilityUri": "https://www.westpac.com.au/business-banking/loans-finance/business-loan/",
            "feesAndPricingUri": "https://www.westpac.com.au/business-banking/loans-finance/business-loan/"
        },
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "With a Westpac business loan you can choose between a fixed or variable rate and select a frequency of repayments that works best for you - such as monthly, quarterly or yearly. The repayment amount is typically worked out over 1 to 30 years and you can use different types of security - such as cash, residential property, commercial property or business assets to secure your loan."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You have option of a fixed rate with certainty of repayments or a variable rate with flexibility to make extra repayments"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "With variable rate, you can make extra payments, which could reduce interest paid over the life of the loan. There is also option to swap between interest only or principal and interest repayments. Redraw allows you to make extra payments and access these funds later."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You have option to fix a rate for up to 5 years. This provides certainty in knowing what you're up for with each repayment. During the fixed rate period there will be no movement in the interest rate or the repayment amount for the term of the agreement. Fees and charges may be payable if you repay the loan early."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Rather than choosing one or the other, you can fix part of your loan - and keep the other part variable."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Loan to value ratios of up to 100% for residential property or 80% for owner-occupied non-specialised commercial property for secured loans up to $3m."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "The term of your Business Loan will vary depending on security offered (you may swap if your situation changes) : Loan term up to 30 years when residential property used as security. Loan term up to 25 years when commercial or rural property used as security."
            },
            {
                "featureType": "EXTRA_REPAYMENTS",
                "additionalInfo": "Subject to terms and conditions, this product includes extra repayment features."
            },
            {
                "featureType": "RELATIONSHIP_MANAGEMENT",
                "additionalInfo": "Relationship management is available for eligible customers."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "With PayTo, you can see, review and authorise all new PayTo payments for things such as recurring bills, memberships and subscriptions before the money leaves your account."
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_LIMIT",
                "additionalValue": "10000.00"
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Customer is - A business entity domiciled in Australia; or an individual 18 years and above or strata corporation domiciled in Australia and requires the funding for business or investment purposes other than investment in residential property."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Banking and borrowing history - existing bank accounts and lending products must be within their approved limits"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Credit history - all borrowers, owners, directors and guarantors must have clear credit records. All statutory payments and ATO liabilities need to be up to date and not under arrangement"
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Domicile : Your business must be registered in Australia."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Security : Business loans would require security in the form of residential property, commercial property, or other types of security. A guarantee will also be required by company directors for corporate borrowers."
            },
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Meets the credit criteria and credit policy requirements under an applicable offer for this product."
            }
        ],
        "fees": [
            {
                "name": "Monthly Line Fee",
                "feeType": "PERIODIC",
                "amount": "15.00",
                "additionalValue": "P1M",
                "additionalInfo": "Establishment and other fees apply."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "VARIABLE",
                "rate": "0.0791",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS",
                "additionalInfo": "Base Rate, a Margin may apply"
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/SecuredBusinessLoan"
    },
    "meta": {}
}