{
    "data": {
        "productId": "TDForeignCurrencyTermDeposit",
        "lastUpdated": "2023-12-11T00:42:12Z",
        "productCategory": "TERM_DEPOSITS",
        "name": "Foreign Currency Term Deposit",
        "description": "A Foreign Currency Term Deposit (FCTD) is a type of term deposit product that allows you to invest foreign currency with Westpac for a fixed term. Westpac may pay you interest at a fixed interest rate for the duration of the Foreign Currency Term Deposit.",
        "brand": "Westpac",
        "isTailored": true,
        "additionalInformation": {
            "overviewUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/bb/WBC-ForeignCurrencyTermDepositPDS_Mar_2020.pdf",
            "termsUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/bb/WBC-ForeignCurrencyTermDepositPDS_Mar_2020.pdf",
            "eligibilityUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/bb/WBC-ForeignCurrencyTermDepositPDS_Mar_2020.pdf",
            "feesAndPricingUri": "https://www.westpac.com.au/content/dam/public/wbc/documents/pdf/bb/WBC-ForeignCurrencyTermDepositPDS_Mar_2020.pdf"
        },
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "Protection against unfavourable foreign exchange rate movements over time"
            },
            {
                "featureType": "FRAUD_PROTECTION",
                "additionalInfo": "The product includes fraud protection features."
            },
            {
                "featureType": "RELATIONSHIP_MANAGEMENT",
                "additionalInfo": "Relationship management is available for eligible customers."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Foreign Currency Term Deposits are available in a wide range of currencies. The currencies that may be available are United States Dollars, Great Britain Pounds, Canadian Dollars, Danish Kroner, Euro, Hong Kong Dollars, Japanese Yen, New Zealand Dollars, Norwegian Kroner, Singapore Dollars, Swiss Francs and other currencies on application. Interest is calculated upon 365 day year for Great Britain Pounds, Hong Kong Dollars and New Zealand Dollars and for rest upon 360 day year. "
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You can manage your transactional requirements for a foreign currency"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "The interest rate is fixed during the Term of the Foreign Currency Term Deposit"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "There are no transaction or monthly service fees payable on a Foreign Currency Term Deposit. However, where Westpac agrees to allow you to withdraw money from your Foreign  Currency Term Deposit before the end of the term, there will be a cost to you in doing so. Please refer to the Early termination section in the overview link for further details. Information on current standard fee, charges and interest rates is available on request."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Foreign Currency Term Deposit interest rates vary from time to time and are set by Westpac. The rate is set at the time the Foreign Currency Term Deposit is opened and is fixed for the term of the Foreign Currency Term Deposit."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Your Foreign Currency Term Deposit can be tailored to your situation by choosing: a) the Principal Amount of your Deposit (subject to the minimum of AUD50,000); b) the Term of your Foreign Currency Term Deposit (7 days to six months); and c) the currency of your Foreign Currency Term Deposit"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Subject to a maximum 6-month term, the following minimum balances and terms apply: a) Deposits greater than $50,000 but less than $100,000 have a minimum 3-month term b) Deposits greater than $100,000 but less than $1,000,000 have a 1-month minimum term c) Deposits greater than $1,000,000 have a 7-day minimum term d) Exceptions are available for security deposits. Westpac will use its current exchange rates the determine the value of your foreign currency. "
            }
        ],
        "constraints": [
            {
                "constraintType": "MIN_BALANCE",
                "additionalValue": "50000.00"
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "Foreign Currency Term Deposits are available for both personal and business customers. Foreign Currency Term Deposits can only be opened in the name of one legal person. Joint accounts are not available."
            }
        ],
        "fees": [
            {
                "name": "Monthly Service Fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "additionalValue": "P1M",
                "additionalInfo": "No Monthly Service Fees"
            },
            {
                "name": "Transaction Fee",
                "feeType": "TRANSACTION",
                "amount": "0.00",
                "additionalInfo": "No Transaction Fees"
            }
        ]
    },
    "links": {
        "self": "https://digital-api.westpac.com.au/cds-au/v1/banking/products/TDForeignCurrencyTermDeposit"
    },
    "meta": {}
}