{
    "data": {
        "productId": "STGTrConcession",
        "lastUpdated": "2024-06-06T00:47:01Z",
        "productCategory": "TRANS_AND_SAVINGS_ACCOUNTS",
        "name": "Concession Account",
        "description": "A low-cost account for individuals who hold a Concession or Health Care card, or receive an Australian Government benefit payment that makes you eligible to hold a Concession or Health Care card.",
        "brand": "St. George Bank",
        "isTailored": false,
        "additionalInformation": {
            "overviewUri": "https://www.stgeorge.com.au/personal/bank-accounts/transaction-accounts/concession-account",
            "termsUri": "https://www.stgeorge.com.au/content/dam/stg/downloads/personal/bank-accounts/SavInvesTransAccounts_Terms.pdf",
            "eligibilityUri": "https://www.stgeorge.com.au/personal/bank-accounts/transaction-accounts/concession-account",
            "feesAndPricingUri": "https://www.stgeorge.com.au/personal/bank-accounts/transaction-accounts/concession-account"
        },
        "cardArt": [
            {
                "imageUri": "https://www.stgeorge.com.au/content/dam/stg/downloads/personal/STG-card-art-app.jpg"
            }
        ],
        "features": [
            {
                "featureType": "OTHER",
                "additionalInfo": "Fraud Money Back Guarantee: Customers may be reimbursed for any unauthorised transactions provided that the customer has not contributed to the loss and contacted us promptly",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/security-centre/protect-yourself/fraud-money-back-guarantee"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Card Lock: Customers can temporarily lock their debit card associated with the bank account, using the mobile banking app if they lose or misplace their card, for up to 15 days",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/popular-features/card-lock"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Cardless Cash can be used to withdraw cash from any St.George, BankSA, Bank of Melbourne and Westpac ATM without a debit card using an iPhone, Android and Windows Phone.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/mobile-banking/cardless-cash"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Spend Tracker groups your transactions into categories to give you helpful insights on your spending habits",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/popular-features/track-my-spending"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Quick balance: Customers can see available balances in their accounts at a glance on your smartphone or watch",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/quick-balance"
            },
            {
                "featureType": "NOTIFICATIONS",
                "additionalValue": "Keep track of your account activity (balances, deposits and withdrawals). Turn on Transaction Notifications via Online or Mobile Banking to receive updates on when you spend and receive money into your transaction account. Choose from receiving updates via SMS, Email or Mobile Notification. ",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/internet-banking/features-benefits/sms-email-alerts"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Apple Pay",
                "additionalInfo": "Multiple ways to pay, securely, with mobile wallet. Pay on the go simply and securely from your mobile device at millions of stores worldwide, where contactless payments are accepted - compatible with Apple Pay.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/ways-to-pay"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Google Pay",
                "additionalInfo": "Multiple ways to pay, securely, with mobile wallet. Pay on the go simply and securely from your mobile device at millions of stores worldwide, where contactless payments are accepted - compatible with Google Pay.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/ways-to-pay"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Samsung Pay",
                "additionalInfo": "Multiple ways to pay, securely, with mobile wallet. Pay on the go simply and securely from your mobile device at millions of stores worldwide, where contactless payments are accepted - compatible with Samsung Pay.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/ways-to-pay"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Tap & Pay",
                "additionalInfo": "Multiple ways to pay, securely, with mobile wallet. Pay on the go simply and securely from your mobile device at millions of stores worldwide, where contactless payments are accepted - compatible with Tap & Pay.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/ways-to-pay"
            },
            {
                "featureType": "DIGITAL_WALLET",
                "additionalValue": "Beem It",
                "additionalInfo": "Multiple ways to pay, securely, with mobile wallet. Pay on the go simply and securely from your mobile device at millions of stores worldwide, where contactless payments are accepted - compatible with Beem It: an app that links to your debit card to make, receive and split payments fast - no matter who the customer banks with.",
                "additionalInfoUri": "https://www.stgeorge.com.au/online-services/ways-to-pay"
            },
            {
                "featureType": "UNLIMITED_TXNS",
                "additionalInfo": "No ATM withdrawal fee at any major bank ATM in Australia and over 50,000 ATMs around the world via the Global ATM Alliance and partner ATMs (other fees may apply)",
                "additionalInfoUri": "https://www.stgeorge.com.au/personal/travel-services/accessing-money-overseas/global-atm-alliance"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "St.George has an extensive branch network that provides the complete range of banking services to our customers. Our friendly staff are on hand to help you in any of our branches and over the phone"
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "Customers can sign in to the mobile banking app simply and securely using their fingerprint on compatible devices."
            },
            {
                "featureType": "DIGITAL_BANKING",
                "additionalInfo": "With PayTo, you can see, review and authorise all new PayTo payments for things such as recurring bills, memberships and subscriptions before the money leaves your account."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "$0 dishonour & overdrawn fees : If you have insufficient funds in your account to cover the transaction amount or your account is overdrawn"
            },
            {
                "featureType": "LOYALTY_PROGRAM",
                "additionalValue": "St. George Lounge on ShopBack",
                "additionalInfo": "Explore ShopBack offers and earn bonus Cashback when you shop via the St. George Lounge on ShopBack. Terms & Conditions apply."
            },
            {
                "featureType": "CASHBACK_OFFER",
                "additionalValue": "30.00",
                "additionalInfo": "New to ShopBack? Join ShopBack and link your St. George card to get $30 bonus Cashback into your ShopBack account when you make your first purchase of $20 or more. Eligibility, T&Cs apply. New ShopBack customers only. Cashback paid into ShopBack account.",
                "additionalInfoUri": "https://www.stgeorge.com.au/shopback"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Statements : We will send statement every 6 monthly, or more frequently on request"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You can pay bills using BPAY"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "You can make direct debits and periodical payments"
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Gambling block requests : The gambling block is a feature available on Visa Debit Cards and Freedom Cards. On eligible cards, the feature is, by default, unblocked, unless  otherwise requested by you. When the gambling block is enabled on your card, we may decline authorisation requests that are identified with the merchant category code for gambling. We will continue to decline these card authorisation requests until you request to unblock your card. The unblock request may take up to 2 days to process."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "Electronic Statements : As an alternative to receiving paper statements in the mail, electronic statements and other important information on one or more of your eligible  deposit accounts may be given via Internet Banking together with an email notifying you when the statement is available. You may agree or consent to electronic  statements, or we may notify you that statements will be made available electronically instead of by mail."
            },
            {
                "featureType": "OTHER",
                "additionalInfo": "We provide the following features : Periodical payments or regular transfers, Direct debits, Recurring payments"
            },
            {
                "featureType": "CARD_ACCESS",
                "additionalValue": "Visa Debit Card (or Freedom Card on request) if you have an Australian residential address."
            },
            {
                "featureType": "FRAUD_PROTECTION",
                "additionalInfo": "The product includes limited range of FRAUD_PROTECTION features."
            },
            {
                "featureType": "RELATIONSHIP_MANAGEMENT",
                "additionalInfo": "RELATIONSHIP_MANAGEMENT is available for eligible customers."
            }
        ],
        "eligibility": [
            {
                "eligibilityType": "OTHER",
                "additionalInfo": "The Concession account is available to individuals who hold a Concession or Health Care card, or receive an Australian Government benefit payment that makes you eligible to hold a Concession or Health Care card."
            },
            {
                "eligibilityType": "RESIDENCY_STATUS",
                "additionalValue": "Those with an Australian residential address and who are currently in Australia."
            }
        ],
        "fees": [
            {
                "name": "Account Keeping Fee",
                "feeType": "PERIODIC",
                "amount": "0.00",
                "additionalValue": "P1M"
            },
            {
                "name": "Overseas Withdrawal Fee",
                "feeType": "WITHDRAWAL",
                "amount": "5.00",
                "additionalInfo": "The fee is Nil ($0) for cash withdrawals from Global ATM Alliance and Westpac Group partner ATMs. To find an overseas ATM visit the link below",
                "additionalInfoUri": "https://www.stgeorge.com.au/personal/travel-services/accessing-money-overseas/global-atm-alliance"
            },
            {
                "name": "Foreign Currency Conversion Fee",
                "feeType": "TRANSACTION",
                "transactionRate": "0.03"
            },
            {
                "name": "Periodical Payment",
                "feeType": "PAYMENT",
                "amount": "0.00",
                "additionalInfo": "This fee is charged for an automated transfer of funds that we make on a regular basis at your request from your account to another specific account. The fee is charged at the time the transaction occurs."
            },
            {
                "name": "Overdrawn Fee",
                "feeType": "EVENT",
                "amount": "0.00"
            },
            {
                "name": "Cash withdrawals Fee",
                "feeType": "WITHDRAWAL",
                "amount": "0.00",
                "additionalInfo": "Cash withdrawals on major bank ATMs in Australia (Certain ATM providers may still charge a fee)"
            },
            {
                "name": "Frequent Statement",
                "feeType": "EVENT",
                "amount": "0.00",
                "additionalInfo": "An additional statement provided to you."
            }
        ],
        "lendingRates": [
            {
                "lendingRateType": "PENALTY",
                "rate": "0.00",
                "calculationFrequency": "P1D",
                "applicationFrequency": "P1M",
                "interestPaymentDue": "IN_ARREARS",
                "additionalValue": "The Unarranged Lending Rate (ULR) is a debit interest rate charged to a transaction account if it becomes overdrawn without arrangement. It will be calculated daily on the debit balance (and deducted on the last business day of each month) using the then current ULR until the account balance is positive again."
            }
        ]
    },
    "links": {
        "self": "https://digital-api.stgeorge.com.au/cds-au/v1/banking/products/STGTrConcession"
    },
    "meta": {}
}